---
kind: type
id: T:Autodesk.Revit.UI.TaskDialogCommonButtons
source: html/5fa611e4-8569-e756-fc93-a4d3c4d391ec.htm
---
# Autodesk.Revit.UI.TaskDialogCommonButtons

A enumerated type containing the standard buttons available for Task Dialogs.

## Syntax (C#)
```csharp
[FlagsAttribute]
public enum TaskDialogCommonButtons
```